## 📋 Plan de Terraform (Dev) con LocalStack

<details>
<summary>Ver cambios propuestos</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.cost_report will be created
  + resource "local_file" "cost_report" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "outputs/cost-report-dev.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

**✅ Validado con LocalStack**  
**📦 Backend:** S3 (terraform-bucket)  
**🌍 Ambiente:** Desarrollo  
